---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalServiceId.#ctor(System.Guid)
source: html/f58d3777-42ec-d2b3-4c28-af72b925a275.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceId.#ctor Method

Creates a new ExternalServiceId instance.

## Syntax (C#)
```csharp
public ExternalServiceId(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The identifier for the ExternalServiceId.